<a href="https://colab.research.google.com/github/Matthieu-Romain/ToyStore-ecommerce/blob/main/Copy_of_SQL_PYthon_Connectors.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Se connecter √† une base de donn√©es SQL avec Python

### Qu‚Äôest-ce qu‚Äôun connecteur SQL ?

Un connecteur SQL permet √† Python de communiquer avec une base de donn√©es SQL (MySQL, PostgreSQL, SQLite‚Ä¶).

Il existe plusieurs m√©thodes pour interagir avec les bases :

![image.png](attachment:image.png)


### Avec mysql.connector (MySQL)

‚úîÔ∏è Avantages :
Contr√¥le total sur les requ√™tes SQL

Intuitif pour les d√©butants SQL

üîΩ Inconv√©nients :
Beaucoup de code "manuel"

N√©cessite de g√©rer soi-m√™me les transactions

In [ ]:
import mysql.connector
from mysql.connector import Error

try:
    connection = mysql.connector.connect(
        host='localhost',
        user='root',
        password='root'
    )

    if connection.is_connected():
        cursor = connection.cursor()
        cursor.execute("CREATE DATABASE IF NOT EXISTS Books;")
        cursor.execute("USE Books;")
        print("Base cr√©√©e et s√©lectionn√©e.")

except Error as e:
    print("Erreur MySQL :", e)
#finally:
    #if connection.is_connected():
        #cursor.close()
        #connection.close()

Base cr√©√©e et s√©lectionn√©e.

### 2. Cr√©ation de tables via requ√™tes SQL

In [ ]:
create_books_table = """
CREATE TABLE IF NOT EXISTS Books (
    book_id INT PRIMARY KEY AUTO_INCREMENT,
    title VARCHAR(255),
    price DECIMAL(10, 2),
    availability BOOLEAN
);
"""
cursor.execute(create_books_table)

In [ ]:
if connection.is_connected():
        cursor.close()
        connection.close()

### Partie 2 : Ins√©rer des donn√©es depuis un DataFrame (pandas)

In [ ]:
import pandas as pd

# Exemple de dataframe
df = pd.DataFrame({
    'title': ['Book A', 'Book B'],
    'price': [9.99, 12.50],
    'availability': [True, False]
})

connection = mysql.connector.connect(
    host='localhost',
    user='root',
    password='root',
    database='books'
)

cursor = connection.cursor()

for _, row in df.iterrows():
    cursor.execute(
        "INSERT INTO Books (title, price, availability) VALUES (%s, %s, %s)",
        (row['title'], row['price'], row['availability'])
    )

connection.commit()

In [ ]:
try:
    cursor = connection.cursor()

    # Requ√™te pour lire tout le contenu de la table Books
    cursor.execute("SELECT * FROM Books limit 10;")

    # R√©cup√©rer les r√©sultats
    rows = cursor.fetchall()

    print(" Contenu de la table Books :")
    for row in rows:
        print(row)

except Error as e:
    print(f"Erreur lors de la lecture : {e}")

 Contenu de la table Books :
(1, 'A Light in the Attic', Decimal('51.77'), 1, 1, 3)
(2, 'Tipping the Velvet', Decimal('53.74'), 1, 1, 1)
(3, 'Soumission', Decimal('50.10'), 1, 1, 1)
(4, 'Sharp Objects', Decimal('47.82'), 1, 1, 4)
(5, 'Sapiens: A Brief History of Humankind', Decimal('54.23'), 1, 1, 5)
(6, 'The Requiem Red', Decimal('22.65'), 1, 1, 1)
(7, 'The Dirty Little Secrets of Getting Your Dream Job', Decimal('33.34'), 1, 1, 4)
(8, 'The Coming Woman: A Novel Based on the Life of the Infamous Feminist, Victoria Woodhull', Decimal('17.93'), 1, 1, 3)
(9, 'The Boys in the Boat: Nine Americans and Their Epic Quest for Gold at the 1936 Berlin Olympics', Decimal('22.60'), 1, 1, 4)
(10, 'The Black Maria', Decimal('52.15'), 1, 1, 1)

In [ ]:
# Lecture de la table Books dans un DataFrame
df_books1 = pd.read_sql("SELECT * FROM Books;", con=connection)

# Affichage
df_books1.head()

C:\Users\manel\AppData\Local\Temp\ipykernel_66852\1505588207.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_books = pd.read_sql("SELECT * FROM Books;", con=connection)

,book_id,title,price,availability,category_id,rating_id
0,1,A Light in the Attic,51.77,1,1.0,3.0
1,2,Tipping the Velvet,53.74,1,1.0,1.0
2,3,Soumission,50.10,1,1.0,1.0
3,4,Sharp Objects,47.82,1,1.0,4.0
4,5,Sapiens: A Brief History of Humankind,54.23,1,1.0,5.0

###  Partie 3 : Avec SQLAlchemy (plus modulaire et puissant)

In [ ]:
from sqlalchemy import create_engine, text
import pandas as pd

# Connexion √† la base MySQL
engine = create_engine("mysql+mysqlconnector://root:root@localhost/books")

# DataFrame
df = pd.DataFrame({
    'title': ['Book C', 'Book D'],
    'price': [15.00, 20.00],
    'availability': [True, True]
})

# Insertion directe
df.to_sql('books', con=engine, if_exists='append', index=False)

# D√©connexion
#engine.dispose()

2

In [ ]:
from sqlalchemy import create_engine, text
import pandas as pd

# Connexion via SQLAlchemy
engine = create_engine("mysql+mysqlconnector://root:root@localhost/books")

# Ouverture d‚Äôune connexion s√©curis√©e
with engine.connect() as conn:

    #  Pour ex√©cuter une requ√™te manuelle (SELECT brut)
    result = conn.execute(text("SELECT * FROM Books limit 10"))
    rows = result.fetchall()
    for row in rows:
        print(row)

(1, 'A Light in the Attic', Decimal('51.77'), 1, 1, 3)
(2, 'Tipping the Velvet', Decimal('53.74'), 1, 1, 1)
(3, 'Soumission', Decimal('50.10'), 1, 1, 1)
(4, 'Sharp Objects', Decimal('47.82'), 1, 1, 4)
(5, 'Sapiens: A Brief History of Humankind', Decimal('54.23'), 1, 1, 5)
(6, 'The Requiem Red', Decimal('22.65'), 1, 1, 1)
(7, 'The Dirty Little Secrets of Getting Your Dream Job', Decimal('33.34'), 1, 1, 4)
(8, 'The Coming Woman: A Novel Based on the Life of the Infamous Feminist, Victoria Woodhull', Decimal('17.93'), 1, 1, 3)
(9, 'The Boys in the Boat: Nine Americans and Their Epic Quest for Gold at the 1936 Berlin Olympics', Decimal('22.60'), 1, 1, 4)
(10, 'The Black Maria', Decimal('52.15'), 1, 1, 1)

In [ ]:
#  Pour charger directement un DataFrame
with engine.connect() as conn:
    df_books2 = pd.read_sql(text("SELECT * FROM Books"), con=conn)

df_books2.head()

,book_id,title,price,availability,category_id,rating_id
0,1,A Light in the Attic,51.77,1,1.0,3.0
1,2,Tipping the Velvet,53.74,1,1.0,1.0
2,3,Soumission,50.10,1,1.0,1.0
3,4,Sharp Objects,47.82,1,1.0,4.0
4,5,Sapiens: A Brief History of Humankind,54.23,1,1.0,5.0

### Partie 4 : SQLite (local, sans serveur)

Cr√©er une base SQLite et des tables

In [ ]:
import sqlite3

connection = sqlite3.connect("database_books.db")

create_books_table = '''
CREATE TABLE IF NOT EXISTS Books (
    book_id INTEGER PRIMARY KEY AUTOINCREMENT,
    title TEXT,
    price REAL,
    availability BOOLEAN
);
'''
connection.execute(create_books_table)
connection.commit()

In [ ]:
#Ins√©rer des donn√©es depuis pandas

df.to_sql('Books', con=connection, if_exists='append', index=False)

2

In [ ]:
df_books3 = pd.read_sql("SELECT * FROM Books", con=connection)

df_books3.head()

   book_id   title  price  availability
0        1  Book C   15.0             1
1        2  Book D   20.0             1
2        3  Book C   15.0             1
3        4  Book D   20.0             1